junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_lcd.c
/* SPDX-License-Identifier: Apache-2.0 */
#include "bk7259_ops.h"

#include <mybot/platform/mybot_lcd.h>

#include <common/avdk_pixel_types.h>
#include <common/bk_err.h>
#include <components/bk_display.h>
#include <components/bk_frame_buffer.h>
#include <api/aosl_atomic.h>
#include "bk7259_platform_log.h"
#include <driver/gpio.h>
#include <gpio_driver.h>
#include <lcd/lcd_mipi_jd9855_320x385.h>
#include <modules/pm.h>
#include <os/os.h>

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#define TAG "mybot_lcd"

#define LCD_NATIVE_WIDTH 320
#define LCD_NATIVE_HEIGHT 385
#define LCD_LOGICAL_WIDTH LCD_NATIVE_HEIGHT
#define LCD_LOGICAL_HEIGHT LCD_NATIVE_WIDTH
#define LCD_BYTES_PER_PIXEL 2
#define LCD_FRAME_BYTES (LCD_NATIVE_WIDTH * LCD_NATIVE_HEIGHT * LCD_BYTES_PER_PIXEL)
#define LCD_FRAME_COUNT 2
#define LCD_RENDER_TIMEOUT_MS 250

#define LCD_POWER_GPIO GPIO_53
#define LCD_RESET_GPIO GPIO_5
#define LCD_BACKLIGHT_GPIO GPIO_7

#define COLOR_BLACK 0x0000
#define COLOR_NEAR_BLACK 0x0841
#define COLOR_WHITE 0xffff
#define COLOR_CYAN 0x3fff
#define COLOR_BLUE 0x4a7f
#define COLOR_GREEN 0x47e8
#define COLOR_YELLOW 0xffe0
#define COLOR_AMBER 0xfd20
#define COLOR_RED 0xf986
#define COLOR_GRAY 0x8410
/* Voiceprint indicator: the MyBot ESP32 boards' saved green, RGB565(114, 255, 156).
 * The not-yet-registered state borrows the shared red instead of the ESP32 amber,
 * which did not stand out against the conversation screen. */
#define COLOR_VP_SAVED 0x77f3

typedef struct {
    bk_display_bus_handle_t bus;
    bk_avdk_lcd_panel_handle_t panel;
    bk_display_ctlr_handle_t controller;
    uint16_t *frames[LCD_FRAME_COUNT];
    aosl_atomic_t frame_busy[LCD_FRAME_COUNT];
    beken_semaphore_t frame_done;
    unsigned int next_frame;
    bool vddio_owned;
    bool power_gpio_owned;
    bool backlight_gpio_owned;
    bool controller_inited;
    bool controller_open;
    bool prepared;
    bool accepting;
    bool sdk_attached;
} lcd_context_t;

static lcd_context_t s_lcd;
static beken_mutex_t s_lcd_lock;
static bool s_frame_buffer_initialized;
static const bk_display_dpu_config_t s_controller_config = {
    .video = {
        .enable = true,
        .decompress = false,
        .format = BK_PIXEL_FORMAT_RGB565,
    },
};

/* Adapted from the Apache-2.0 MyBot ESP32 display implementation. */
static const uint8_t s_digits[10][5] = {
    {0x3e, 0x51, 0x49, 0x45, 0x3e}, {0x00, 0x42, 0x7f, 0x40, 0x00},
    {0x42, 0x61, 0x51, 0x49, 0x46}, {0x21, 0x41, 0x45, 0x4b, 0x31},
    {0x18, 0x14, 0x12, 0x7f, 0x10}, {0x27, 0x45, 0x45, 0x45, 0x39},
    {0x3c, 0x4a, 0x49, 0x49, 0x30}, {0x01, 0x71, 0x09, 0x05, 0x03},
    {0x36, 0x49, 0x49, 0x49, 0x36}, {0x06, 0x49, 0x49, 0x29, 0x1e},
};

static const uint8_t s_letters[26][5] = {
    {0x7e, 0x11, 0x11, 0x11, 0x7e},
    {0x7f, 0x49, 0x49, 0x49, 0x36}, {0x3e, 0x41, 0x41, 0x41, 0x22},
    {0x7f, 0x41, 0x41, 0x22, 0x1c}, {0x7f, 0x49, 0x49, 0x49, 0x41},
    {0x7f, 0x09, 0x09, 0x09, 0x01}, {0x3e, 0x41, 0x49, 0x49, 0x7a},
    {0x7f, 0x08, 0x08, 0x08, 0x7f}, {0x00, 0x41, 0x7f, 0x41, 0x00},
    {0x20, 0x40, 0x41, 0x3f, 0x01}, {0x7f, 0x08, 0x14, 0x22, 0x41},
    {0x7f, 0x40, 0x40, 0x40, 0x40}, {0x7f, 0x02, 0x0c, 0x02, 0x7f},
    {0x7f, 0x04, 0x08, 0x10, 0x7f}, {0x3e, 0x41, 0x41, 0x41, 0x3e},
    {0x7f, 0x09, 0x09, 0x09, 0x06}, {0x3e, 0x41, 0x51, 0x21, 0x5e},
    {0x7f, 0x09, 0x19, 0x29, 0x46}, {0x46, 0x49, 0x49, 0x49, 0x31},
    {0x01, 0x01, 0x7f, 0x01, 0x01}, {0x3f, 0x40, 0x40, 0x40, 0x3f},
    {0x1f, 0x20, 0x40, 0x20, 0x1f}, {0x3f, 0x40, 0x38, 0x40, 0x3f},
    {0x63, 0x14, 0x08, 0x14, 0x63}, {0x07, 0x08, 0x70, 0x08, 0x07},
    {0x61, 0x51, 0x49, 0x45, 0x43},
};

static const uint8_t *glyph_for(char character)
{
    static const uint8_t space[5] = {0};
    static const uint8_t dash[5] = {0x08, 0x08, 0x08, 0x08, 0x08};
    static const uint8_t question[5] = {0x02, 0x01, 0x51, 0x09, 0x06};

    if (character >= '0' && character <= '9') {
        return s_digits[character - '0'];
    }
    if (character >= 'A' && character <= 'Z') {
        return s_letters[character - 'A'];
    }
    if (character == ' ') {
        return space;
    }
    if (character == '-') {
        return dash;
    }
    return question;
}

static bool ensure_lcd_lock(void)
{
    if (s_lcd_lock) {
        return true;
    }
    return rtos_init_mutex(&s_lcd_lock) == BK_OK;
}

static void put_pixel(uint16_t *frame, int x, int y, uint16_t color)
{
    if (!frame || x < 0 || x >= LCD_LOGICAL_WIDTH || y < 0 || y >= LCD_LOGICAL_HEIGHT) {
        return;
    }

    /* AVDK ROTATE_90 is a 270-degree buffer rotation into the native panel. */
    int native_x = y;
    int native_y = LCD_LOGICAL_WIDTH - x - 1;
    frame[(size_t)native_y * LCD_NATIVE_WIDTH + (size_t)native_x] = color;
}

static void fill_screen(uint16_t *frame, uint16_t color)
{
    for (size_t i = 0; i < (size_t)LCD_NATIVE_WIDTH * LCD_NATIVE_HEIGHT; ++i) {
        frame[i] = color;
    }
}

static void fill_rect(uint16_t *frame, int x, int y, int width, int height, uint16_t color)
{
    for (int row = 0; row < height; ++row) {
        for (int column = 0; column < width; ++column) {
            put_pixel(frame, x + column, y + row, color);
        }
    }
}

static void draw_line(uint16_t *frame, int x0, int y0, int x1, int y1, int thickness,
                      uint16_t color)
{
    int dx = x1 > x0 ? x1 - x0 : x0 - x1;
    int sx = x0 < x1 ? 1 : -1;
    int dy = y1 > y0 ? y0 - y1 : y1 - y0;
    int sy = y0 < y1 ? 1 : -1;
    int error = dx + dy;

    for (;;) {
        fill_rect(frame, x0 - thickness / 2, y0 - thickness / 2, thickness, thickness, color);
        if (x0 == x1 && y0 == y1) {
            return;
        }
        int doubled = error * 2;
        if (doubled >= dy) {
            error += dy;
            x0 += sx;
        }
        if (doubled <= dx) {
            error += dx;
            y0 += sy;
        }
    }
}

static void draw_ring(uint16_t *frame, int center_x, int center_y, int radius, int thickness,
                      uint16_t color)
{
    int outer_squared = radius * radius;
    int inner_radius = radius - thickness;
    int inner_squared = inner_radius * inner_radius;

    for (int y = center_y - radius; y <= center_y + radius; ++y) {
        for (int x = center_x - radius; x <= center_x + radius; ++x) {
            int dx = x - center_x;
            int dy = y - center_y;
            int distance = dx * dx + dy * dy;
            if (distance <= outer_squared && distance >= inner_squared) {
                put_pixel(frame, x, y, color);
            }
        }
    }
}

static void draw_disc(uint16_t *frame, int center_x, int center_y, int radius, uint16_t color)
{
    int radius_squared = radius * radius;

    for (int y = center_y - radius; y <= center_y + radius; ++y) {
        for (int x = center_x - radius; x <= center_x + radius; ++x) {
            int dx = x - center_x;
            int dy = y - center_y;
            if (dx * dx + dy * dy <= radius_squared) {
                put_pixel(frame, x, y, color);
            }
        }
    }
}

