junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_lcd.c
static void draw_character(uint16_t *frame, int x, int y, char character, int scale,
                           uint16_t color)
{
    const uint8_t *glyph = glyph_for(character);

    for (int column = 0; column < 5; ++column) {
        for (int row = 0; row < 7; ++row) {
            if (glyph[column] & (1u << row)) {
                fill_rect(frame, x + column * scale, y + row * scale, scale, scale, color);
            }
        }
    }
}

static void draw_text_centered(uint16_t *frame, int y, const char *text, size_t length, int scale,
                               uint16_t color)
{
    int width = length == 0 ? 0 : ((int)length * 6 - 1) * scale;
    int x = (LCD_LOGICAL_WIDTH - width) / 2;

    for (size_t i = 0; i < length; ++i) {
        draw_character(frame, x + (int)i * 6 * scale, y, text[i], scale, color);
    }
}

static uint16_t screen_color(mybot_lcd_screen_t screen)
{
    switch (screen) {
    case MYBOT_LCD_SCREEN_STARTING:
        return COLOR_CYAN;
    case MYBOT_LCD_SCREEN_WIFI_PROVISIONING:
        return COLOR_AMBER;
    case MYBOT_LCD_SCREEN_WIFI_DISCONNECTED:
    case MYBOT_LCD_SCREEN_FAILED:
        return COLOR_RED;
    case MYBOT_LCD_SCREEN_STARTING_SERVICES:
        return COLOR_BLUE;
    case MYBOT_LCD_SCREEN_PAIRING:
        return COLOR_YELLOW;
    case MYBOT_LCD_SCREEN_READY:
        return COLOR_GREEN;
    case MYBOT_LCD_SCREEN_IN_CONVERSATION:
        return COLOR_CYAN;
    case MYBOT_LCD_SCREEN_STOPPING:
        return COLOR_GRAY;
    case MYBOT_LCD_SCREEN_PAIR_CODE:
    case MYBOT_LCD_SCREEN_COUNT:
        return COLOR_CYAN;
    }
    return COLOR_GRAY;
}

static const char *screen_label(mybot_lcd_screen_t screen)
{
    switch (screen) {
    case MYBOT_LCD_SCREEN_STARTING:
        return "STARTING";
    case MYBOT_LCD_SCREEN_WIFI_PROVISIONING:
        return "WIFI SETUP";
    case MYBOT_LCD_SCREEN_WIFI_DISCONNECTED:
        return "WIFI LOST";
    case MYBOT_LCD_SCREEN_STARTING_SERVICES:
        return "SERVICES";
    case MYBOT_LCD_SCREEN_PAIRING:
        return "PAIRING";
    case MYBOT_LCD_SCREEN_PAIR_CODE:
        return "PAIR CODE";
    case MYBOT_LCD_SCREEN_READY:
        return "READY";
    case MYBOT_LCD_SCREEN_IN_CONVERSATION:
        return "CONVERSATION";
    case MYBOT_LCD_SCREEN_FAILED:
        return "FAILED";
    case MYBOT_LCD_SCREEN_STOPPING:
        return "STOPPING";
    case MYBOT_LCD_SCREEN_COUNT:
        return NULL;
    }
    return NULL;
}

static mybot_lcd_indicator_t server_indicator(uint32_t indicators)
{
    /* The SDK guarantees mutual exclusion. Keep a stable precedence for a
     * malformed bitmask received from an older/custom caller. */
    if (indicators & MYBOT_LCD_INDICATOR_LISTENING) {
        return MYBOT_LCD_INDICATOR_LISTENING;
    }
    if (indicators & MYBOT_LCD_INDICATOR_THINKING) {
        return MYBOT_LCD_INDICATOR_THINKING;
    }
    if (indicators & MYBOT_LCD_INDICATOR_SPEAKING) {
        return MYBOT_LCD_INDICATOR_SPEAKING;
    }
    return MYBOT_LCD_INDICATOR_NONE;
}

static uint16_t server_indicator_color(mybot_lcd_indicator_t indicator)
{
    switch (indicator) {
    case MYBOT_LCD_INDICATOR_LISTENING:
        return COLOR_CYAN;
    case MYBOT_LCD_INDICATOR_THINKING:
        return COLOR_AMBER;
    case MYBOT_LCD_INDICATOR_SPEAKING:
        return COLOR_GREEN;
    case MYBOT_LCD_INDICATOR_NONE:
    case MYBOT_LCD_INDICATOR_VP_REGISTERED:
        return COLOR_CYAN;
    }
    return COLOR_CYAN;
}

static void draw_server_state_overlay(uint16_t *frame, mybot_lcd_indicator_t indicator)
{
    const int center_x = LCD_LOGICAL_WIDTH / 2 - 53;
    const int center_y = 66;

    if (indicator == MYBOT_LCD_INDICATOR_NONE ||
        indicator == MYBOT_LCD_INDICATOR_VP_REGISTERED) {
        return;
    }

    draw_disc(frame, center_x, center_y, 17, server_indicator_color(indicator));
    switch (indicator) {
    case MYBOT_LCD_INDICATOR_LISTENING:
        fill_rect(frame, center_x - 3, center_y - 9, 6, 12, COLOR_BLACK);
        draw_line(frame, center_x - 7, center_y - 1, center_x - 7, center_y + 3, 2,
                  COLOR_BLACK);
        draw_line(frame, center_x - 7, center_y + 3, center_x, center_y + 7, 2, COLOR_BLACK);
        draw_line(frame, center_x, center_y + 7, center_x + 7, center_y + 3, 2, COLOR_BLACK);
        draw_line(frame, center_x + 7, center_y + 3, center_x + 7, center_y - 1, 2,
                  COLOR_BLACK);
        draw_line(frame, center_x, center_y + 7, center_x, center_y + 11, 2, COLOR_BLACK);
        break;
    case MYBOT_LCD_INDICATOR_THINKING:
        draw_disc(frame, center_x - 8, center_y, 3, COLOR_BLACK);
        draw_disc(frame, center_x, center_y, 3, COLOR_BLACK);
        draw_disc(frame, center_x + 8, center_y, 3, COLOR_BLACK);
        break;
    case MYBOT_LCD_INDICATOR_SPEAKING:
        fill_rect(frame, center_x - 10, center_y - 4, 5, 8, COLOR_BLACK);
        draw_line(frame, center_x - 5, center_y - 4, center_x, center_y - 8, 3, COLOR_BLACK);
        draw_line(frame, center_x - 5, center_y + 4, center_x, center_y + 8, 3, COLOR_BLACK);
        draw_line(frame, center_x, center_y - 8, center_x, center_y + 8, 3, COLOR_BLACK);
        draw_line(frame, center_x + 5, center_y - 5, center_x + 9, center_y - 9, 2,
                  COLOR_BLACK);
        draw_line(frame, center_x + 5, center_y + 5, center_x + 9, center_y + 9, 2,
                  COLOR_BLACK);
        break;
    case MYBOT_LCD_INDICATOR_NONE:
    case MYBOT_LCD_INDICATOR_VP_REGISTERED:
        break;
    }
}

static void draw_state_icon(uint16_t *frame, mybot_lcd_screen_t screen, uint16_t color)
{
    const int center_x = LCD_LOGICAL_WIDTH / 2;
    const int center_y = 118;

    draw_ring(frame, center_x, center_y, 70, 5, color);
    switch (screen) {
    case MYBOT_LCD_SCREEN_STARTING:
    case MYBOT_LCD_SCREEN_STARTING_SERVICES:
        draw_line(frame, center_x, center_y - 37, center_x, center_y, 8, color);
        draw_line(frame, center_x, center_y, center_x + 28, center_y + 20, 8, color);
        break;
    case MYBOT_LCD_SCREEN_WIFI_PROVISIONING:
    case MYBOT_LCD_SCREEN_PAIRING:
        draw_disc(frame, center_x - 32, center_y, 9, color);
        draw_disc(frame, center_x, center_y, 9, color);
        draw_disc(frame, center_x + 32, center_y, 9, color);
        break;
    case MYBOT_LCD_SCREEN_WIFI_DISCONNECTED:
    case MYBOT_LCD_SCREEN_FAILED:
        draw_line(frame, center_x - 28, center_y - 28, center_x + 28, center_y + 28, 9,
                  color);
        draw_line(frame, center_x + 28, center_y - 28, center_x - 28, center_y + 28, 9,
                  color);
        break;
    case MYBOT_LCD_SCREEN_READY:
        draw_line(frame, center_x - 36, center_y, center_x - 10, center_y + 27, 9, color);
        draw_line(frame, center_x - 10, center_y + 27, center_x + 43, center_y - 31, 9,
                  color);
        break;
    case MYBOT_LCD_SCREEN_IN_CONVERSATION:
        fill_rect(frame, center_x - 39, center_y - 23, 12, 46, color);
        fill_rect(frame, center_x - 6, center_y - 40, 12, 80, color);
        fill_rect(frame, center_x + 27, center_y - 23, 12, 46, color);
        break;
    case MYBOT_LCD_SCREEN_STOPPING:
        fill_rect(frame, center_x - 35, center_y - 5, 70, 10, color);
        break;
    case MYBOT_LCD_SCREEN_PAIR_CODE:
    case MYBOT_LCD_SCREEN_COUNT:
        break;
    }
}

static void draw_voiceprint_glyph(uint16_t *frame, int center_x, int center_y, uint16_t color)
{
    /* A single waveform trace reads as a voiceprint; the badge's disc color,
     * not the glyph, carries the registration state. */
    draw_line(frame, center_x - 10, center_y, center_x - 7, center_y, 3, color);
    draw_line(frame, center_x - 7, center_y, center_x - 4, center_y - 4, 3, color);
    draw_line(frame, center_x - 4, center_y - 4, center_x - 1, center_y + 6, 3, color);
    draw_line(frame, center_x - 1, center_y + 6, center_x + 2, center_y - 8, 3, color);
    draw_line(frame, center_x + 2, center_y - 8, center_x + 5, center_y + 3, 3, color);
    draw_line(frame, center_x + 5, center_y + 3, center_x + 8, center_y, 3, color);
    draw_line(frame, center_x + 8, center_y, center_x + 10, center_y, 3, color);
}

static void draw_voiceprint_overlay(uint16_t *frame, bool registered)
{
    const int center_x = LCD_LOGICAL_WIDTH / 2 + 53;
    const int center_y = 66;

    draw_disc(frame, center_x, center_y, 17, registered ? COLOR_VP_SAVED : COLOR_RED);
    draw_voiceprint_glyph(frame, center_x, center_y, COLOR_BLACK);
}

static int pair_code_length(const char *code, size_t *out_length)
{
    if (!code || !out_length) {
        return -1;
    }

    size_t length = 0;
    while (length < MYBOT_LCD_PAIR_CODE_CAPACITY && code[length] != '\0') {
        ++length;
    }
    if (length != 6) {
        return -1;
    }
    for (size_t index = 0; index < length; ++index) {
        if (code[index] < '0' || code[index] > '9') {
            return -1;
        }
    }
    *out_length = length;
    return 0;
}

static int render_content(uint16_t *frame, const mybot_lcd_content_t *content)
{
    if (!frame || !content || content->screen < MYBOT_LCD_SCREEN_STARTING ||
        content->screen >= MYBOT_LCD_SCREEN_COUNT) {
        return -1;
    }

    fill_screen(frame, content->screen == MYBOT_LCD_SCREEN_PAIR_CODE ? COLOR_BLACK
                                                                     : COLOR_NEAR_BLACK);
    const char *label = screen_label(content->screen);
    if (!label) {
        return -1;
    }

