junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_lcd.c
    if (content->screen == MYBOT_LCD_SCREEN_PAIR_CODE) {
        size_t code_length;
        if (pair_code_length(content->pair_code, &code_length) < 0) {
            return -1;
        }
        int scale = 8;
        while ((((int)code_length * 6 - 1) * scale > LCD_LOGICAL_WIDTH - 24) && scale > 1) {
            --scale;
        }
        draw_text_centered(frame, 56, label, strlen(label), 4, COLOR_CYAN);
        draw_text_centered(frame, (LCD_LOGICAL_HEIGHT - 7 * scale) / 2 + 22,
                           content->pair_code, code_length, scale, COLOR_WHITE);
        return 0;
    }

    uint16_t color = screen_color(content->screen);
    draw_state_icon(frame, content->screen, color);
    draw_text_centered(frame, 235, label, strlen(label), 4, color);
    if (content->screen == MYBOT_LCD_SCREEN_IN_CONVERSATION) {
        draw_server_state_overlay(frame, server_indicator(content->indicators));
        draw_voiceprint_overlay(
            frame, (content->indicators & MYBOT_LCD_INDICATOR_VP_REGISTERED) != 0);
    }
    return 0;
}

static void release_frame(unsigned int index)
{
    if (index >= LCD_FRAME_COUNT) {
        return;
    }
    if (aosl_atomic_xchg(&s_lcd.frame_busy[index], 0) != 0 &&
        s_lcd.frame_done) {
        (void)rtos_set_semaphore(&s_lcd.frame_done);
    }
}

static avdk_err_t frame_release_callback(void *frame)
{
    for (unsigned int index = 0; index < LCD_FRAME_COUNT; ++index) {
        if (frame == s_lcd.frames[index]) {
            release_frame(index);
            return AVDK_ERR_OK;
        }
    }
    return AVDK_ERR_INVAL;
}

static int wait_for_frame(unsigned int *out_index)
{
    uint32_t started_at = rtos_get_time();

    for (;;) {
        for (unsigned int offset = 0; offset < LCD_FRAME_COUNT; ++offset) {
            unsigned int index = (s_lcd.next_frame + offset) % LCD_FRAME_COUNT;
            if (aosl_atomic_read(&s_lcd.frame_busy[index]) == 0) {
                *out_index = index;
                return 0;
            }
        }

        uint32_t elapsed = rtos_get_time() - started_at;
        if (elapsed >= LCD_RENDER_TIMEOUT_MS ||
            rtos_get_semaphore(&s_lcd.frame_done, LCD_RENDER_TIMEOUT_MS - elapsed) != BK_OK) {
            MYBOT_LOGE(TAG, "timed out waiting for a display frame");
            return -1;
        }
    }
}

static int submit_content_locked(const mybot_lcd_content_t *content)
{
    unsigned int index;
    if (!s_lcd.controller || wait_for_frame(&index) < 0 ||
        render_content(s_lcd.frames[index], content) < 0) {
        return -1;
    }

    aosl_atomic_set(&s_lcd.frame_busy[index], 1);
    avdk_err_t result =
        bk_display_flush(s_lcd.controller, s_lcd.frames[index], frame_release_callback);
    if (result != AVDK_ERR_OK) {
        /* A failed update may already have become the active scanout frame. */
        MYBOT_LOGE(TAG, "frame submission failed: %d", result);
        return -1;
    }
    s_lcd.next_frame = (index + 1) % LCD_FRAME_COUNT;
    return 0;
}

static int set_backlight(bool enabled)
{
    if (!s_lcd.backlight_gpio_owned) {
        return -1;
    }
    return (enabled ? bk_gpio_set_output_low(LCD_BACKLIGHT_GPIO)
                    : bk_gpio_set_output_high(LCD_BACKLIGHT_GPIO)) == BK_OK
               ? 0
               : -1;
}

static int panel_power_on(void)
{
    if (gpio_dev_unmap(LCD_BACKLIGHT_GPIO) != BK_OK ||
        gpio_dev_unmap(LCD_POWER_GPIO) != BK_OK || gpio_dev_unmap(LCD_RESET_GPIO) != BK_OK ||
        bk_gpio_enable_output(LCD_RESET_GPIO) != BK_OK ||
        bk_gpio_set_output_low(LCD_RESET_GPIO) != BK_OK ||
        bk_gpio_enable_output(LCD_BACKLIGHT_GPIO) != BK_OK ||
        bk_gpio_pull_down(LCD_BACKLIGHT_GPIO) != BK_OK) {
        return -1;
    }
    /* The pinned BK7259 API exposes this setter as bool but its HAL returns
     * BK_OK (0) on success; keep the reference board's best-effort use. */
    (void)bk_gpio_set_capacity(LCD_BACKLIGHT_GPIO, GPIO_DRIVER_CAPACITY_3);
    if (bk_gpio_set_output_high(LCD_BACKLIGHT_GPIO) != BK_OK ||
        bk_gpio_enable_output(LCD_POWER_GPIO) != BK_OK ||
        bk_gpio_pull_up(LCD_POWER_GPIO) != BK_OK ||
        bk_gpio_set_output_high(LCD_POWER_GPIO) != BK_OK) {
        return -1;
    }
    s_lcd.backlight_gpio_owned = true;
    if (set_backlight(false) < 0) {
        return -1;
    }
    s_lcd.power_gpio_owned = true;

    pm_auxldo_ctrl_cfg_t vddio = {
        .ldo = AUXLDOS_SEL_1P8V,
        .out = PM_AUXLDO_1P8V_OUT_1P8V,
        .user = PM_AUXLDO_USER_DISPLAY,
        .state = PM_AUXLDO_ENABLE,
    };
    if (bk_pm_auxldo_ctrl_vote(&vddio) != BK_OK) {
        return -1;
    }
    s_lcd.vddio_owned = true;
    rtos_delay_milliseconds(10);
    return 0;
}

static int panel_power_off(void)
{
    int result = 0;

    if (s_lcd.backlight_gpio_owned) {
        if (set_backlight(false) != 0) {
            MYBOT_LOGW(TAG, "failed to disable panel backlight");
            result = -1;
        } else {
            s_lcd.backlight_gpio_owned = false;
        }
    }
    if (bk_gpio_enable_output(LCD_RESET_GPIO) != BK_OK ||
        bk_gpio_set_output_low(LCD_RESET_GPIO) != BK_OK) {
        MYBOT_LOGW(TAG, "failed to assert panel reset");
        return -1;
    }
    if (s_lcd.vddio_owned) {
        pm_auxldo_ctrl_cfg_t vddio = {
            .ldo = AUXLDOS_SEL_1P8V,
            .out = PM_AUXLDO_1P8V_OUT_1P8V,
            .user = PM_AUXLDO_USER_DISPLAY,
            .state = PM_AUXLDO_DISABLE,
        };
        if (bk_pm_auxldo_ctrl_vote(&vddio) != BK_OK) {
            MYBOT_LOGW(TAG, "failed to release panel VDDIO");
            return -1;
        }
        s_lcd.vddio_owned = false;
    }
    if (s_lcd.power_gpio_owned) {
        if (bk_gpio_set_output_low(LCD_POWER_GPIO) != BK_OK) {
            MYBOT_LOGW(TAG, "failed to disable panel 3.3V");
            result = -1;
        } else {
            s_lcd.power_gpio_owned = false;
        }
    }
    return result;
}

static bool resources_owned(void)
{
    return s_lcd.controller || s_lcd.panel || s_lcd.bus || s_lcd.frames[0] ||
           s_lcd.frames[1] || s_lcd.frame_done || s_lcd.vddio_owned ||
           s_lcd.power_gpio_owned || s_lcd.backlight_gpio_owned;
}

static int teardown_locked(void)
{
    if (s_lcd.backlight_gpio_owned) {
        if (set_backlight(false) == 0) {
            s_lcd.backlight_gpio_owned = false;
        }
    }
    if (s_lcd.controller) {
        if (s_lcd.controller_open) {
            if (bk_display_close(s_lcd.controller) != AVDK_ERR_OK) {
                MYBOT_LOGW(TAG, "failed to close display controller");
            } else {
                s_lcd.controller_open = false;
            }
        }
        if (s_lcd.controller_inited) {
            if (bk_display_deinit(s_lcd.controller) != AVDK_ERR_OK) {
                MYBOT_LOGE(TAG, "display deinit failed; retaining owned framebuffers");
                return -1;
            }
            s_lcd.controller_inited = false;
        }
        if (bk_display_delete(s_lcd.controller) != AVDK_ERR_OK) {
            MYBOT_LOGE(TAG, "display delete failed; retaining owned framebuffers");
            return -1;
        }
        s_lcd.controller = NULL;
        s_lcd.controller_inited = false;
        s_lcd.controller_open = false;
    }
    if (s_lcd.panel) {
        if (bk_lcd_panel_delete(s_lcd.panel) != BK_OK) {
            MYBOT_LOGE(TAG, "panel delete failed; retaining display resources");
            return -1;
        }
        s_lcd.panel = NULL;
    }
    if (s_lcd.bus) {
        if (bk_display_bus_delete(s_lcd.bus) != AVDK_ERR_OK) {
            MYBOT_LOGE(TAG, "DSI bus delete failed; retaining display resources");
            return -1;
        }
        s_lcd.bus = NULL;
    }
    int power_result = panel_power_off();

