junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_lcd.c
    /* display_deinit returns both the current and update buffers via the callback. */
    for (unsigned int index = 0; index < LCD_FRAME_COUNT; ++index) {
        aosl_atomic_set(&s_lcd.frame_busy[index], 0);
        if (s_lcd.frames[index]) {
            bk_frame_buffer_free(s_lcd.frames[index]);
            s_lcd.frames[index] = NULL;
        }
    }
    if (s_lcd.frame_done) {
        (void)rtos_deinit_semaphore(&s_lcd.frame_done);
        s_lcd.frame_done = NULL;
    }
    s_lcd.next_frame = 0;
    return power_result;
}

int bk7259_lcd_prepare(void)
{
    if (!ensure_lcd_lock() || rtos_lock_mutex(&s_lcd_lock) != BK_OK) {
        return -1;
    }
    if (s_lcd.prepared) {
        rtos_unlock_mutex(&s_lcd_lock);
        return 0;
    }
    if (resources_owned() && teardown_locked() < 0) {
        rtos_unlock_mutex(&s_lcd_lock);
        return -1;
    }

    s_lcd.accepting = false;
    s_lcd.sdk_attached = false;
    if (!s_frame_buffer_initialized) {
        bk_frame_buffer_init();
        s_frame_buffer_initialized = true;
    }
    if (rtos_init_semaphore(&s_lcd.frame_done, LCD_FRAME_COUNT) != BK_OK) {
        goto failed;
    }
    for (unsigned int index = 0; index < LCD_FRAME_COUNT; ++index) {
        s_lcd.frames[index] = bk_frame_buffer_malloc(MEM_SLAB_HEAP_UNCODED, LCD_FRAME_BYTES);
        if (!s_lcd.frames[index]) {
            MYBOT_LOGE(TAG, "failed to allocate framebuffer %u", index);
            goto failed;
        }
    }
    if (panel_power_on() < 0 || bk_display_dsi_bus_new(&s_lcd.bus, NULL) != AVDK_ERR_OK) {
        goto failed;
    }

    const bk_lcd_panel_config_t panel_config = {.reset_pin = LCD_RESET_GPIO};
    if (bk_lcd_mipi_panel_new(s_lcd.bus, &panel_config,
                              &lcd_device_jd9855_mipi_320x385, &s_lcd.panel) != BK_OK) {
        goto failed;
    }
    if (bk_display_dpu_ctlr_new(&s_lcd.controller, s_lcd.panel, &s_controller_config) !=
        AVDK_ERR_OK) {
        goto failed;
    }
    if (bk_display_init(s_lcd.controller) != AVDK_ERR_OK) {
        goto failed;
    }
    s_lcd.controller_inited = true;
    if (bk_display_open(s_lcd.controller) != AVDK_ERR_OK) {
        goto failed;
    }
    s_lcd.controller_open = true;

    mybot_lcd_content_t starting = {.screen = MYBOT_LCD_SCREEN_STARTING};
    if (submit_content_locked(&starting) < 0) {
        goto failed;
    }
    rtos_delay_milliseconds(20);
    if (set_backlight(true) < 0) {
        goto failed;
    }
    s_lcd.prepared = true;
    s_lcd.accepting = true;
    MYBOT_LOGI(TAG, "JD9855 MIPI display ready");
    rtos_unlock_mutex(&s_lcd_lock);
    return 0;

failed:
    MYBOT_LOGE(TAG, "display preparation failed");
    (void)teardown_locked();
    s_lcd.prepared = false;
    rtos_unlock_mutex(&s_lcd_lock);
    return -1;
}

void bk7259_lcd_shutdown(void)
{
    if (!s_lcd_lock || rtos_lock_mutex(&s_lcd_lock) != BK_OK) {
        return;
    }
    s_lcd.accepting = false;
    s_lcd.sdk_attached = false;
    if (resources_owned()) {
        int result = teardown_locked();
        s_lcd.prepared = false;
        if (result == 0) {
            MYBOT_LOGI(TAG, "display shut down");
        }
    }
    rtos_unlock_mutex(&s_lcd_lock);
}

int bk7259_lcd_show_screen(mybot_lcd_screen_t screen)
{
    if (screen == MYBOT_LCD_SCREEN_PAIR_CODE) {
        /* A pair-code screen is only valid with the server-provided six
         * digit value; do not render a misleading placeholder. */
        return -1;
    }

    mybot_lcd_content_t content = {.screen = screen};

    if (!s_lcd_lock || rtos_lock_mutex(&s_lcd_lock) != BK_OK) {
        return -1;
    }
    int result = s_lcd.prepared && s_lcd.accepting ? submit_content_locked(&content) : -1;
    rtos_unlock_mutex(&s_lcd_lock);
    return result;
}

static int lcd_sdk_init(void **out_context)
{
    if (!out_context || !s_lcd_lock || rtos_lock_mutex(&s_lcd_lock) != BK_OK) {
        return -1;
    }
    *out_context = NULL;
    if (!s_lcd.prepared || !s_lcd.accepting || s_lcd.sdk_attached) {
        rtos_unlock_mutex(&s_lcd_lock);
        return -1;
    }
    s_lcd.sdk_attached = true;
    *out_context = &s_lcd;
    rtos_unlock_mutex(&s_lcd_lock);
    return 0;
}

static int lcd_sdk_render(void *context, const mybot_lcd_content_t *content)
{
    if (context != &s_lcd || !content || !s_lcd_lock ||
        rtos_lock_mutex(&s_lcd_lock) != BK_OK) {
        return -1;
    }
    int result = s_lcd.prepared && s_lcd.accepting && s_lcd.sdk_attached
                     ? submit_content_locked(content)
                     : -1;
    rtos_unlock_mutex(&s_lcd_lock);
    return result;
}

static void lcd_sdk_destroy(void *context)
{
    if (context != &s_lcd || !s_lcd_lock || rtos_lock_mutex(&s_lcd_lock) != BK_OK) {
        return;
    }
    s_lcd.sdk_attached = false;
    rtos_unlock_mutex(&s_lcd_lock);
}

const mybot_lcd_ops_t g_mybot_bk7259_lcd_ops = {
    .init = lcd_sdk_init,
    .render = lcd_sdk_render,
    .destroy = lcd_sdk_destroy,
};
